/*******************************************************************************
* INTEL CONFIDENTIAL
* Copyright 2010 Intel Corporation All Rights Reserved
*
* The source code contained or described herein and all documents related to the
* source code ("Material") are owned by Intel Corporation or its suppliers or
* licensors. Title to the Material remains with Intel Corporation or its
* suppliers and licensors. The Material contains trade secrets and proprietary
* and confidential information of Intel or its suppliers and licensors. The
* Material is protected by worldwide copyright and trade secret laws and treaty
* provisions. No part of the Material may be used, copied, reproduced, modified,
* published, uploaded, posted, transmitted, distributed, or disclosed in any way
* without Intel's prior express written permission.
*
* No license under any patent, copyright, trade secret or other intellectual
* property right is granted to or conferred upon you by disclosure or delivery
* of the Materials, either expressly, by implication, inducement, estoppel or
* otherwise. Any license under such intellectual property rights must be express
* and approved by Intel in writing.
*
*******************************************************************************/


//
// General Purpose Strings
//
"Yes" = "Yes";
"No" = "No";
"Unknown" = "Unknown";


//
// Feature Tab Strings
//

// input eax = 1, output = edx
"FeatureShortName_1_EDX_00000001" = "FPU";
"FeatureShortName_1_EDX_00000002" = "VME";
"FeatureShortName_1_EDX_00000004" = "DE";
"FeatureShortName_1_EDX_00000008" = "PSE";
"FeatureShortName_1_EDX_00000010" = "TSC";
"FeatureShortName_1_EDX_00000020" = "MSR";
"FeatureShortName_1_EDX_00000040" = "PAE";
"FeatureShortName_1_EDX_00000080" = "MCE";
"FeatureShortName_1_EDX_00000100" = "CX8";
"FeatureShortName_1_EDX_00000200" = "APIC";
"FeatureShortName_1_EDX_00000800" = "SEP";
"FeatureShortName_1_EDX_00001000" = "MTRR";
"FeatureShortName_1_EDX_00002000" = "PGE";
"FeatureShortName_1_EDX_00004000" = "MCA";
"FeatureShortName_1_EDX_00008000" = "CMOV";
"FeatureShortName_1_EDX_00010000" = "PAT";
"FeatureShortName_1_EDX_00020000" = "PSE36";
"FeatureShortName_1_EDX_00040000" = "PSN";
"FeatureShortName_1_EDX_00080000" = "CLFSH";
"FeatureShortName_1_EDX_00200000" = "DS";
"FeatureShortName_1_EDX_00400000" = "ACPI";
"FeatureShortName_1_EDX_00800000" = "MMX";
"FeatureShortName_1_EDX_01000000" = "FXSR";
"FeatureShortName_1_EDX_02000000" = "SSE";
"FeatureShortName_1_EDX_04000000" = "SSE2";
"FeatureShortName_1_EDX_08000000" = "SS";
"FeatureShortName_1_EDX_10000000" = "HTT";
"FeatureShortName_1_EDX_20000000" = "TM";
"FeatureShortName_1_EDX_80000000" = "PBE";

// input eax = 1, output = ecx
"FeatureShortName_1_ECX_00000001" = "SSE3";
"FeatureShortName_1_ECX_00000002" = "PCLMULQDQ";
"FeatureShortName_1_ECX_00000004" = "DTES64";
"FeatureShortName_1_ECX_00000008" = "MONITOR";
"FeatureShortName_1_ECX_00000010" = "DS-CPL";
"FeatureShortName_1_ECX_00000020" = "VMX (VT-x)";
"FeatureShortName_1_ECX_00000040" = "SMX";
"FeatureShortName_1_ECX_00000080" = "EST";
"FeatureShortName_1_ECX_00000100" = "TM2";
"FeatureShortName_1_ECX_00000200" = "SSSE3";
"FeatureShortName_1_ECX_00000400" = "CNXT-ID";
"FeatureShortName_1_ECX_00000800" = "SDBG";
"FeatureShortName_1_ECX_00001000" = "FMA";
"FeatureShortName_1_ECX_00002000" = "CX16";
"FeatureShortName_1_ECX_00004000" = "xTPR";
"FeatureShortName_1_ECX_00008000" = "PDCM";
"FeatureShortName_1_ECX_00020000" = "PCID";
"FeatureShortName_1_ECX_00040000" = "DCA";
"FeatureShortName_1_ECX_00080000" = "SSE4.1";
"FeatureShortName_1_ECX_00100000" = "SSE4.2";
"FeatureShortName_1_ECX_00200000" = "x2APIC";
"FeatureShortName_1_ECX_00400000" = "MOVBE";
"FeatureShortName_1_ECX_00800000" = "POPCNT";
"FeatureShortName_1_ECX_01000000" = "TSC-DEADLINE";
"FeatureShortName_1_ECX_02000000" = "AES";
"FeatureShortName_1_ECX_04000000" = "XSAVE";
"FeatureShortName_1_ECX_08000000" = "OSXSAVE";
"FeatureShortName_1_ECX_10000000" = "AVX";
"FeatureShortName_1_ECX_20000000" = "FP16C";
"FeatureShortName_1_ECX_40000000" = "RDRAND";

// input eax = 7, output = ebx
"FeatureShortName_7_EBX_00000001" = "FSGSBASE";
"FeatureShortName_7_EBX_00000008" = "BMI1";
"FeatureShortName_7_EBX_00000010" = "HLE";
"FeatureShortName_7_EBX_00000020" = "AVX2";
"FeatureShortName_7_EBX_00000080" = "SMEP";
"FeatureShortName_7_EBX_00000100" = "BMI2";
"FeatureShortName_7_EBX_00000200" = "ERMS";
"FeatureShortName_7_EBX_00000400" = "INVPCID";
"FeatureShortName_7_EBX_00000800" = "RTM";
"FeatureShortName_7_EBX_00004000" = "MPX";
"FeatureShortName_7_EBX_00010000" = "AVX-512";
"FeatureShortName_7_EBX_00040000" = "RDSEED";
"FeatureShortName_7_EBX_00080000" = "ADX";
"FeatureShortName_7_EBX_00100000" = "SMAP";
"FeatureShortName_7_EBX_00800000" = "CLFLUSHOPT";
"FeatureShortName_7_EBX_02000000" = "IPT";
"FeatureShortName_7_EBX_04000000" = "AVX-512.PFI";
"FeatureShortName_7_EBX_08000000" = "AVX-512.ERI";
"FeatureShortName_7_EBX_10000000" = "AVX-512.CDI";
"FeatureShortName_7_EBX_20000000" = "SHA";

// input eax = 7, output = ecx
"FeatureShortName_7_ECX_00000001" = "PREFETCHWT1";

// input eax = d, output = eax
"FeatureShortName_D_EAX_00000001" = "XSAVEOPT";
"FeatureShortName_D_EAX_00000002" = "XSAVEC";
"FeatureShortName_D_EAX_00000004" = "XG1";
"FeatureShortName_D_EAX_00000008" = "XSS";

// input eax = 80000001, output = edx
"FeatureShortName_80000001_EDX_00000800" = "SYSCALLRET";
"FeatureShortName_80000001_EDX_00100000" = "XD";
"FeatureShortName_80000001_EDX_04000000" = "PAGE1GB";
"FeatureShortName_80000001_EDX_08000000" = "RDTSCP";
"FeatureShortName_80000001_EDX_20000000" = "EM64T";

// input eax = 80000001, output = ecx
"FeatureShortName_80000001_ECX_00000001" = "LAHFSAHF";
"FeatureShortName_80000001_ECX_00000020" = "LZCNT";
"FeatureShortName_80000001_ECX_00000100" = "PREFETCHW";

// input eax = 80000007, output = edx
"FeatureShortName_80000007_EDX_00000100" = "INVTSC";

// SIMD FP Features
"FeatureShortNameMXFP_00000040" = "DAZ";
"FeatureShortNameMXFP_00008000" = "FTZ";


//
// Cache Tab Strings
//

// Cache Type
"CacheType00" = "Null";
"CacheType01" = "Data";
"CacheType02" = "Instruction";
"CacheType03" = "Unified";
"CacheType04" = "Unknown";
"CacheType05" = "Unknown";
"CacheType06" = "Unknown";
"CacheType07" = "Unknown";

"CacheIndex00" = "Null descriptor";
"CacheIndex01" = "Instruction TLB: 4 KByte Pages, 4-way set associative, 32 entries";
"CacheIndex02" = "Instruction TLB: 4 MByte Pages, 4-way set associative, 2 entries";
"CacheIndex03" = "Data TLB: 4 KByte Pages, 4-way set associative, 64 entries";
"CacheIndex04" = "Data TLB: 4 MByte Pages, 4-way set associative, 8 entries";
"CacheIndex05" = "Data TLB1: 4 MByte Pages, 4-way set associative, 32 entries";
"CacheIndex06" = "1st-level instruction cache: 8 KBytes, 4-way set associative, 32 byte line size";
"CacheIndex08" = "1st-level instruction cache: 16 KBytes, 4-way set associative, 32 byte line size";
"CacheIndex09" = "1st-level instruction cache: 32 KBytes, 4-way set associative, 64 byte line size";	// new
"CacheIndex0A" = "1st-level data cache: 8 KBytes, 2-way set associative, 32 byte line size";
"CacheIndex0B" = "Instruction TLB: 4 MByte pages, 4-way set associative, 4 entries";
"CacheIndex0C" = "1st-level data cache: 16 KBytes, 4-way set associative, 32 byte line size";
"CacheIndex0D" = "1st-level data cache: 16 KBytes, 4-way set associative, 64 byte line size";			// new
"CacheIndex0E" = "1st-level data cache: 24 KBytes, 6-way set associative, 64 byte line size";			// new
"CacheIndex21" = "2nd-level cache: 256 KBytes, 8-way set associative, 64 byte line size";				// new
"CacheIndex22" = "3rd-level cache: 512 KBytes, 4-way set associative, 64 byte line size, 2 lines per sector";
"CacheIndex23" = "3rd-level cache: 1 MBytes, 8-way set associative, 64 byte line size, 2 lines per sector";
"CacheIndex25" = "3rd-level cache: 2 MBytes, 8-way set associative, 64 byte line size, 2 lines per sector";
"CacheIndex29" = "3rd-level cache: 4 MBytes, 8-way set associative, 64 byte line size, 2 lines per sector";
"CacheIndex2C" = "1st-level data cache: 32 KBytes, 8-way set associative, 64 byte line size";
"CacheIndex30" = "1st-level instruction cache: 32 KBytes, 8-way set associative, 64 byte line size";
"CacheIndex40" = "No 2nd-level cache or, if processor contains a valid 2nd-level cache, no 3rd-level cache";
"CacheIndex41" = "2nd-level cache: 128 KBytes, 4-way set associative, 32 byte line size";
"CacheIndex42" = "2nd-level cache: 256 KBytes, 4-way set associative, 32 byte line size";
"CacheIndex43" = "2nd-level cache: 512 KBytes, 4-way set associative, 32 byte line size";
"CacheIndex44" = "2nd-level cache: 1 MByte, 4-way set associative, 32 byte line size";
"CacheIndex45" = "2nd-level cache: 2 MByte, 4-way set associative, 32 byte line size";
"CacheIndex46" = "3rd-level cache: 4 MByte, 4-way set associative, 64 byte line size";
"CacheIndex47" = "3rd-level cache: 8 MByte, 8-way set associative, 64 byte line size";
"CacheIndex48" = "2nd-level cache: 3 MByte, 12-way set associative, 64 byte line size";		// new
"CacheIndex49" = "2nd-level cache: 4 MByte, 16-way set associative, 64 byte line size";
"CacheIndex4A" = "3rd-level cache: 6 MByte, 12-way set associative, 64 byte line size";
"CacheIndex4B" = "3rd-level cache: 8 MByte, 16-way set associative, 64 byte line size";
"CacheIndex4C" = "3rd-level cache: 12 MByte, 12-way set associative, 64 byte line size";
"CacheIndex4D" = "3rd-level cache: 16 MByte, 16-way set associative, 64 byte line size";
"CacheIndex4E" = "2nd-level cache: 6 MByte, 24-way set associative, 64 byte line size";
"CacheIndex4F" = "Instruction TLB: 4 KByte pages, 32 entries";								// new
"CacheIndex50" = "Instruction TLB: 4 KByte and 2-MByte or 4-MByte pages, 64 entries";
"CacheIndex51" = "Instruction TLB: 4 KByte and 2-MByte or 4-MByte pages, 128 entries";
"CacheIndex52" = "Instruction TLB: 4 KByte and 2-MByte or 4-MByte pages, 256 entries";
"CacheIndex55" = "Instruction TLB: 2-MByte or 4-MByte pages, fully associative, 7 entries";		// new
"CacheIndex56" = "Data TLB0: 4 MByte pages, 4-way set associative, 16 entries";
"CacheIndex57" = "Data TLB0: 4 KByte pages, 4-way set associative, 16 entries";
"CacheIndex59" = "Data TLB0: 4 KByte, fully associative, 16 entries";							// new
"CacheIndex5A" = "Data TLB0: 2 MByte and 4 MByte pages, 4-way set associative, 32 entries";		// new
"CacheIndex5B" = "Data TLB: 4 KByte and 4 MByte pages, 64 entries";
"CacheIndex5C" = "Data TLB: 4 KByte and 4 MByte pages,128 entries";
"CacheIndex5D" = "Data TLB: 4 KByte and 4 MByte pages,256 entries";
"CacheIndex60" = "1st-level data cache: 16 KByte, 8-way set associative, 64 byte line size";
"CacheIndex66" = "1st-level data cache: 8 KByte, 4-way set associative, 64 byte line size";
"CacheIndex67" = "1st-level data cache: 16 KByte, 4-way set associative, 64 byte line size";
"CacheIndex68" = "1st-level data cache: 32 KByte, 4-way set associative, 64 byte line size";
"CacheIndex70" = "Trace cache: 12 K-μop, 8-way set associative";
"CacheIndex71" = "Trace cache: 16 K-μop, 8-way set associative";
"CacheIndex72" = "Trace cache: 32 K-μop, 8-way set associative";
"CacheIndex78" = "2nd-level cache: 1 MByte, 4-way set associative, 64byte line size";
"CacheIndex79" = "2nd-level cache: 128 KByte, 8-way set associative, 64 byte line size, 2 lines per sector";
"CacheIndex7A" = "2nd-level cache: 256 KByte, 8-way set associative, 64 byte line size, 2 lines per sector";
"CacheIndex7B" = "2nd-level cache: 512 KByte, 8-way set associative, 64 byte line size, 2 lines per sector";
"CacheIndex7C" = "2nd-level cache: 1 MByte, 8-way set associative, 64 byte line size, 2 lines per sector";
"CacheIndex7D" = "2nd-level cache: 2 MByte, 8-way set associative, 64byte line size";
"CacheIndex7F" = "2nd-level cache: 512 KByte, 2-way set associative, 64-byte line size";

"CacheIndex80" = "2nd-level cache: 512 KByte, 8-way set associative, 64 byte line size";		// new

"CacheIndex82" = "2nd-level cache: 256 KByte, 8-way set associative, 32 byte line size";
"CacheIndex83" = "2nd-level cache: 512 KByte, 8-way set associative, 32 byte line size";
"CacheIndex84" = "2nd-level cache: 1 MByte, 8-way set associative, 32 byte line size";
"CacheIndex85" = "2nd-level cache: 2 MByte, 8-way set associative, 32 byte line size";
"CacheIndex86" = "2nd-level cache: 512 KByte, 4-way set associative, 64 byte line size";
"CacheIndex87" = "2nd-level cache: 1 MByte, 8-way set associative, 64 byte line size";
"CacheIndexB0" = "Instruction TLB: 4 KByte Pages, 4-way set associative, 128 entries";
"CacheIndexB1" = "Instruction TLB: 2 MByte Pages, 4-way, 8 entries or 4 Mbyte pages, 4-way, 4 entries";
"CacheIndexB2" = "Instruction TLB: 4 KByte Pages, 4-way set associative, 64 entries";		// new					// new
"CacheIndexB3" = "Data TLB: 4 KByte Pages, 4-way set associative, 128 entries";
"CacheIndexB4" = "Data TLB1: 4 KByte Pages, 4-way set associative, 256 entries";


"CacheIndexC0" = "Data TLB: 4 KByte and 4 MByte pages, 4-way associative, 8 entries";	// new
"CacheIndexCA" = "Shared 2nd-Level TLB: 4 KByte pages, 4-way associative, 512 entries";	// new
"CacheIndexE4" = "3rd-level cache: 8 MByte, 16-way set associative, 64 byte line size";	// new
"CacheIndexEA" = "3rd-level cache: 12MByte, 24-way set associative, 64 byte line size";	// new
"CacheIndexEB" = "3rd-level cache: 18MByte, 24-way set associative, 64 byte line size";	// new
"CacheIndexEC" = "3rd-level cache: 24MByte, 24-way set associative, 64 byte line size";	// new

"CacheIndexF0" = "64-Byte Prefetching";
"CacheIndexF1" = "128-Byte Prefetching";

"CacheIndexFF" = "CPUID leaf 2 does not report cache descriptor information, use CPUID leaf 4 to query cache parameters";	

//
// Miscellaneous Tab Strings
//
"MiscThreads" = "Processor Threads";
"MiscLogicals" = "Logical Processors per Package";
"MiscCores" = "Cores per Physical Package";
"MiscLogsCore" = "Logical Processors per Core";
"MiscMMLeaf" = "Monitor/MWait Leaf";
"MiscMMLeafMin" = "Smallest Line Size (Bytes)";
"MiscMMLeafMax" = "Largest Line Size (Bytes)";
"MiscMMLeafInt" = "Interrupts Treated as Break-Event";
"MiscMMLeafC0" = "Number of C0 Sub-States Supported";
"MiscMMLeafC1" = "Number of C1 Sub-States Supported";
"MiscMMLeafC2" = "Number of C2 Sub-States Supported";
"MiscMMLeafC3" = "Number of C3 Sub-States Supported";
"MiscMMLeafC4" = "Number of C4 Sub-States Supported";
"MiscPowerLeaf" = "Thermal & Power Management Leaf";
"MiscPowerTurboBoost" = "Intel Turbo Boost Technology Available";
"MiscPowerInterruptThresholds" = "Number of Interrupt Thresholds";
"MiscPowerACNTMCNT" = "ACNT/MCNT Support";
"MiscPowerPerformanceEnergyBias" = "Performance-Energy Bias Preference Supported";
"MiscAddrSize" = "Address Sizes";
"MiscPhysical" = "Physical Address (GB)";
"MiscLogical" = "Logical Address (GB)";


//
// Architectural Performance Monitoring Tab Strings
//

// When adding more events update the MAXKNOWNPERFEVENTS define in Cpuid.h to the new count.
"PerfEvent_00000001" = "Core Cycles";
"PerfEvent_00000002" = "Instructions Retired";
"PerfEvent_00000004" = "Reference Cycles";
"PerfEvent_00000008" = "Last-Level Cache Reference";
"PerfEvent_00000010" = "Last-Level Cache Misses";
"PerfEvent_00000020" = "Branch Instructions Retired";
"PerfEvent_00000040" = "Branch Mispredict Instructions Retired";
